# joins()
- There are four types of joins
- Inner join
- Left join
- Right join
- Full join

In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'Name':['Gowtham','Siva Rao','Hardeep','John'],
                   'Salary':[30000,40000,50000,60000],
                   'Age':[25,23,30,50]})
df1

       Name  Salary  Age
0   Gowtham   30000   25
1  Siva Rao   40000   23
2   Hardeep   50000   30
3      John   60000   50

In [11]:
df2 = pd.DataFrame({'Name':['Sruthi','Azeem','Hardeep','John'],
                   'Salary':[30000,40000,50000,60000],
                   'Age':[25,23,30,50],
                   'Roll_No':[1001,1002,1003,1004]})
df2

      Name  Salary  Age  Roll_No
0   Sruthi   30000   25     1001
1    Azeem   40000   23     1002
2  Hardeep   50000   30     1003
3     John   60000   50     1004

### concat()
- used to join two tables

In [12]:
col_df=pd.concat([df1,df2],axis=1) # column wise
col_df

       Name  Salary  Age     Name  Salary  Age  Roll_No
0   Gowtham   30000   25   Sruthi   30000   25     1001
1  Siva Rao   40000   23    Azeem   40000   23     1002
2   Hardeep   50000   30  Hardeep   50000   30     1003
3      John   60000   50     John   60000   50     1004

In [13]:
row_df=pd.concat([df1,df2],axis=0) # row wise
row_df

       Name  Salary  Age  Roll_No
0   Gowtham   30000   25      NaN
1  Siva Rao   40000   23      NaN
2   Hardeep   50000   30      NaN
3      John   60000   50      NaN
0    Sruthi   30000   25   1001.0
1     Azeem   40000   23   1002.0
2   Hardeep   50000   30   1003.0
3      John   60000   50   1004.0

## merge()

In [14]:
### INNER JOIN
pd.merge(df1,df2,how='inner',on='Name')

      Name  Salary_x  Age_x  Salary_y  Age_y  Roll_No
0  Hardeep     50000     30     50000     30     1003
1     John     60000     50     60000     50     1004

In [16]:
### LEFT JOIN
pd.merge(df1,df2,how='left',on='Name')

       Name  Salary_x  Age_x  Salary_y  Age_y  Roll_No
0   Gowtham     30000     25       NaN    NaN      NaN
1  Siva Rao     40000     23       NaN    NaN      NaN
2   Hardeep     50000     30   50000.0   30.0   1003.0
3      John     60000     50   60000.0   50.0   1004.0

In [17]:
### RIGHT JOIN
pd.merge(df1,df2,how='right',on='Name')

      Name  Salary_x  Age_x  Salary_y  Age_y  Roll_No
0   Sruthi       NaN    NaN     30000     25     1001
1    Azeem       NaN    NaN     40000     23     1002
2  Hardeep   50000.0   30.0     50000     30     1003
3     John   60000.0   50.0     60000     50     1004

In [19]:
### FULL/OUTER JOIN
pd.merge(df1,df2,how='outer',on='Name')

       Name  Salary_x  Age_x  Salary_y  Age_y  Roll_No
0   Gowtham   30000.0   25.0       NaN    NaN      NaN
1  Siva Rao   40000.0   23.0       NaN    NaN      NaN
2   Hardeep   50000.0   30.0   50000.0   30.0   1003.0
3      John   60000.0   50.0   60000.0   50.0   1004.0
4    Sruthi       NaN    NaN   30000.0   25.0   1001.0
5     Azeem       NaN    NaN   40000.0   23.0   1002.0

# Duplicate_Datetime

In [4]:
# Creating dataframe using dictionary
dict1 = {'Gender':["Male","Female","Male","Female","Male"],
        'Married':["Yes","No","No","No","Yes"],
        'Loan_Status':["Yes","No","No","No","Yes"]}
df = pd.DataFrame(dict1)
df

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No
2    Male      No          No
3  Female      No          No
4    Male     Yes         Yes

In [5]:
# with keep = "first" - mark duplicates as True except for the first one

duplicates_first=df.duplicated(keep="first")
duplicates_first

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [6]:
duplicates_first=df.duplicated(keep="last")
duplicates_first

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [9]:
df[df['Gender']=='Male']

  Gender Married Loan_Status
0   Male     Yes         Yes
2   Male      No          No
4   Male     Yes         Yes

In [10]:
df[duplicates_first]

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No

In [7]:
df.loc[duplicates_first,:]  ## removing duplicates

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No

In [11]:
# with keep = "first"- keep duplicates which occured first time and drop others
df1= df.drop_duplicates(keep="first")
df1

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No
2    Male      No          No

In [12]:
df1= df.drop_duplicates(keep="last") 
df1

   Gender Married Loan_Status
2    Male      No          No
3  Female      No          No
4    Male     Yes         Yes

In [16]:
df1.reset_index()

   index  Gender Married Loan_Status
0      2    Male      No          No
1      3  Female      No          No
2      4    Male     Yes         Yes

In [17]:
df1.reset_index(drop=True)

   Gender Married Loan_Status
0    Male      No          No
1  Female      No          No
2    Male     Yes         Yes

In [18]:
# using drop_duplicates() method
df.drop_duplicates(keep="first",subset=["Gender"])

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No

In [19]:
df.drop_duplicates(keep="first",subset=["Gender","Married"])

   Gender Married Loan_Status
0    Male     Yes         Yes
1  Female      No          No
2    Male      No          No

In [24]:
import warnings
warnings.filterwarnings('ignore')

# date_range()

In [20]:
# Day wise     # freq='D'--->days
print(pd.date_range('2000/1/11',periods=5))

DatetimeIndex(['2000-01-11', '2000-01-12', '2000-01-13', '2000-01-14',
               '2000-01-15'],
              dtype='datetime64[ns]', freq='D')

In [21]:
print(pd.date_range('20/3/2022',periods=5))

DatetimeIndex(['2022-03-20', '2022-03-21', '2022-03-22', '2022-03-23',
               '2022-03-24'],
              dtype='datetime64[ns]', freq='D')

In [22]:
print(pd.date_range('2000-1-11',periods=5))

DatetimeIndex(['2000-01-11', '2000-01-12', '2000-01-13', '2000-01-14',
               '2000-01-15'],
              dtype='datetime64[ns]', freq='D')

In [25]:
# Month wise
print(pd.date_range('23/05/1994',periods=5,freq='M'))

DatetimeIndex(['1994-05-31', '1994-06-30', '1994-07-31', '1994-08-31',
               '1994-09-30'],
              dtype='datetime64[ns]', freq='M')

In [26]:
# year wise
print(pd.date_range('1/1/2011',periods=5,freq='Y'))

DatetimeIndex(['2011-12-31', '2012-12-31', '2013-12-31', '2014-12-31',
               '2015-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [27]:
# Hour wise
print(pd.date_range('1/1/2011',periods=5,freq='3H'))

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 03:00:00',
               '2011-01-01 06:00:00', '2011-01-01 09:00:00',
               '2011-01-01 12:00:00'],
              dtype='datetime64[ns]', freq='3H')

In [29]:
# minutes wise
print(pd.date_range('1/1/2011',periods=5,freq='10min'))

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 00:10:00',
               '2011-01-01 00:20:00', '2011-01-01 00:30:00',
               '2011-01-01 00:40:00'],
              dtype='datetime64[ns]', freq='10T')

In [31]:
# seconds wise
print(pd.date_range('1/1/2011',periods=5,freq='10s'))

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 00:00:10',
               '2011-01-01 00:00:20', '2011-01-01 00:00:30',
               '2011-01-01 00:00:40'],
              dtype='datetime64[ns]', freq='10S')

In [32]:
start=pd.datetime(2011, 1, 1)
print('Start: ',start)

end = pd.datetime(2011, 1, 20)
print("Stop: ",end)

print(pd.date_range(start,end))

Start:  2011-01-01 00:00:00
Stop:  2011-01-20 00:00:00
DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14', '2011-01-15', '2011-01-16',
               '2011-01-17', '2011-01-18', '2011-01-19', '2011-01-20'],
              dtype='datetime64[ns]', freq='D')

In [33]:
df = pd.DataFrame({'name':['Tom','Andy','Lucas'],
                  'DoB':['08-05-1997','04-28-1996','12/16/1995']})
df

    name         DoB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12/16/1995

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [35]:
df['DoB']=pd.to_datetime(df['DoB'])

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 176.0+ bytes

In [39]:
df['DoB']

0   1997-08-05
1   1996-04-28
2   1995-12-16
Name: DoB, dtype: datetime64[ns]

In [38]:
df['DoB'].dt.year # seperating years

0    1997
1    1996
2    1995
Name: DoB, dtype: int64

In [40]:
today=pd.to_datetime('today')
today

Timestamp('2023-03-01 10:14:38.432910')

In [41]:
today=pd.to_datetime('today')
today.year

2023

# calculate age

In [42]:
today.year-df['DoB'].dt.year

0    26
1    27
2    28
Name: DoB, dtype: int64

In [43]:
today.year-1997

26

In [44]:
df["Age"]= today.year-df['DoB'].dt.year 
df

    name        DoB  Age
0    Tom 1997-08-05   26
1   Andy 1996-04-28   27
2  Lucas 1995-12-16   28

In [48]:
df['DoB'].dt.day

0     5
1    28
2    16
Name: DoB, dtype: int64

# sample

In [52]:
df=pd.read_csv(r"C:/Users/sss/Downloads/loandata.csv")
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP001640,Male,Yes,0,Graduate,Yes,39147,4750.0,120.0,360.0,1.0,Semiurban,Y
610,LP001536,Male,Yes,3+,Graduate,No,39999,0.0,600.0,180.0,0.0,Semiurban,Y
611,LP001585,NaN,Yes,3+,Graduate,No,51763,0.0,700.0,300.0,1.0,Urban,Y
612,LP002101,Male,Yes,0,Graduate,NaN,63337,0.0,490.0,180.0,1.0,Urban,Y
613,LP002317,Male,Yes,3+,Graduate,No,81000,0.0,360.0,360.0,0.0,Rural,N

In [55]:
sample_data=df.sample(150) 
sample_data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
215,LP001024,Male,Yes,2,Graduate,No,3200,700.0,70.0,360.0,1.0,Urban,Y
288,LP002571,Male,No,0,Not Graduate,No,3691,0.0,110.0,360.0,1.0,Rural,Y
6,LP002345,Male,Yes,0,Graduate,No,1025,2773.0,112.0,360.0,1.0,Rural,Y
79,LP001643,Male,Yes,0,Graduate,No,2383,2138.0,58.0,360.0,NaN,Rural,Y

# saving data into local directory

# to_csv

In [56]:
sample_data.to_csv("mydata.csv")

In [58]:
sample_data.to_csv("D:/SBT/mydata.csv")

In [59]:
pwd

'C:\\Users\\sss\\Module-2'